Model: "discriminator_body"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense (Dense)                (None, 512)               6291968
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 512)               0
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 512)               0
_________________________________________________________________
dropout (Dropout)            (None, 512)               0
_________________________________________________________________
dense_2 (Dense)              (None, 512)               262656
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 512)               0
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0
_________________________________________________________________
dense_3 (Dense)              (None, 512)               262656
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 512)               0
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0
=================================================================
Total params: 7,079,936
Trainable params: 7,079,936
Non-trainable params: 0
_________________________________________________________________
Model: "discriminator"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 64, 64, 3)]  0
__________________________________________________________________________________________________
flatten (Flatten)               (None, 12288)        0           input_1[0][0]
__________________________________________________________________________________________________
discriminator_body (Sequential) (None, 512)          7079936     flatten[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1)            513         discriminator_body[1][0]
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 35)           17955       discriminator_body[1][0]
==================================================================================================
Total params: 7,098,404
Trainable params: 7,098,404
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "generator_body"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_6 (Dense)              (None, 256)               34816
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 256)               0
_________________________________________________________________
batch_normalization (BatchNo (None, 256)               1024
_________________________________________________________________
dense_7 (Dense)              (None, 512)               131584
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 512)               0
_________________________________________________________________
batch_normalization_1 (Batch (None, 512)               2048
_________________________________________________________________
dense_8 (Dense)              (None, 1024)              525312
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 1024)              0
_________________________________________________________________
batch_normalization_2 (Batch (None, 1024)              4096
_________________________________________________________________
dense_9 (Dense)              (None, 2048)              2099200
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 2048)              0
_________________________________________________________________
batch_normalization_3 (Batch (None, 2048)              8192
_________________________________________________________________
dense_10 (Dense)             (None, 12288)             25178112
_________________________________________________________________
reshape (Reshape)            (None, 64, 64, 3)         0
=================================================================
Total params: 27,984,384
Trainable params: 27,976,704
Non-trainable params: 7,680
_________________________________________________________________
Model: "generator"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_2 (InputLayer)            [(None, 100)]        0
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 35)]         0
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 135)          0           input_2[0][0]
                                                                 input_3[0][0]
__________________________________________________________________________________________________
generator_body (Sequential)     (None, 64, 64, 3)    27984384    concatenate[0][0]
==================================================================================================
Total params: 27,984,384
Trainable params: 27,976,704
Non-trainable params: 7,680
__________________________________________________________________________________________________
