Model: "generator_body"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense (Dense)                (None, 8192)              1114112
_________________________________________________________________
reshape (Reshape)            (None, 4, 4, 512)         0
_________________________________________________________________
batch_normalization (BatchNo (None, 4, 4, 512)         2048
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 8, 8, 256)         3277056
_________________________________________________________________
batch_normalization_1 (Batch (None, 8, 8, 256)         1024
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 16, 16, 128)       819328
_________________________________________________________________
batch_normalization_2 (Batch (None, 16, 16, 128)       512
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 32, 32, 64)        204864
_________________________________________________________________
batch_normalization_3 (Batch (None, 32, 32, 64)        256
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 64, 64, 3)         4803
=================================================================
Total params: 5,424,003
Trainable params: 5,422,083
Non-trainable params: 1,920
_________________________________________________________________
Model: "generator"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 100)]        0
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 35)]         0
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 135)          0           input_1[0][0]
                                                                 input_2[0][0]
__________________________________________________________________________________________________
generator_body (Sequential)     (None, 64, 64, 3)    5424003     concatenate[0][0]
==================================================================================================
Total params: 5,424,003
Trainable params: 5,422,083
Non-trainable params: 1,920
__________________________________________________________________________________________________
Model: "critic_body"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 32, 32, 64)        4864
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 32, 32, 64)        0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 16, 16, 128)       204928
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 16, 16, 128)       0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 256)         819456
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 8, 8, 256)         0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 512)         3277312
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 4, 4, 512)         0
_________________________________________________________________
flatten (Flatten)            (None, 8192)              0
=================================================================
Total params: 4,306,560
Trainable params: 4,306,560
Non-trainable params: 0
_________________________________________________________________
Model: "critic"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_3 (InputLayer)            [(None, 64, 64, 3)]  0
__________________________________________________________________________________________________
critic_body (Sequential)        (None, 8192)         4306560     input_3[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            8193        critic_body[1][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 35)           286755      critic_body[1][0]
==================================================================================================
Total params: 4,601,508
Trainable params: 4,601,508
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "critic_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_5 (InputLayer)            [(None, 100)]        0
__________________________________________________________________________________________________
input_6 (InputLayer)            [(None, 35)]         0
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 64, 64, 3)]  0
__________________________________________________________________________________________________
generator (Model)               (None, 64, 64, 3)    5424003     input_5[0][0]
                                                                 input_6[0][0]
__________________________________________________________________________________________________
random_weighted_average (Random (100, 64, 64, 3)     0           input_4[0][0]
                                                                 generator[1][0]
__________________________________________________________________________________________________
critic (Model)                  multiple             4601508     generator[1][0]
                                                                 input_4[0][0]
                                                                 random_weighted_average[0][0]
==================================================================================================
Total params: 10,025,511
Trainable params: 4,601,508
Non-trainable params: 5,424,003
__________________________________________________________________________________________________
Model: "generator_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_7 (InputLayer)            [(None, 100)]        0
__________________________________________________________________________________________________
input_8 (InputLayer)            [(None, 35)]         0
__________________________________________________________________________________________________
generator (Model)               (None, 64, 64, 3)    5424003     input_7[0][0]
                                                                 input_8[0][0]
__________________________________________________________________________________________________
critic (Model)                  multiple             4601508     generator[2][0]
==================================================================================================
Total params: 10,025,511
Trainable params: 5,422,083
Non-trainable params: 4,603,428
__________________________________________________________________________________________________
